Siamian/STM32-F1/Smokehouse_thermometer/Smokehouse_thermometer_version_2/Smokehouse_thermometer_2/src/ds18b20.c
/*
 * ds18b20.c
 *
 *  Created on: Jan 24, 2022
 *      Author: damia
 */
#include "stm32f1xx.h"
#include <string.h>
#include "ds18b20.h"
#include "wire.h"

#define DS18B20_ROM_CODE_SIZE		8
#define DS18B20_SCRATCHPAD_SIZE    9

#define DS18B20_READ_ROM           0x33
#define DS18B20_MATCH_ROM          0x55
#define DS18B20_SKIP_ROM           0xCC

#define DS18B20_CONVERT_T          0x44
#define DS18B20_READ_SCRATCHPAD    0xBE

/* --------------------- OLD -----------------------
HAL_StatusTypeDef ds18b20_init(void)
{
	return wire_init();
}
*/

HAL_StatusTypeDef ds18b20_read_address(uint8_t* rom_code)
{
	int i;
	uint8_t crc;
	printf("\n1-1\n");
	if (wire_reset() != HAL_OK)
		return HAL_ERROR;
	printf("\n1-2\n");
	wire_write(DS18B20_READ_ROM);
	for (i =0; i < DS18B20_ROM_CODE_SIZE; i++)
		rom_code[i] = wire_read();

	crc = wire_crc(rom_code, DS18B20_ROM_CODE_SIZE - 1);
	printf("\n1-3\n");
	if (rom_code[DS18B20_ROM_CODE_SIZE - 1] == crc)
		return HAL_OK;
	else
		return HAL_ERROR;
}

static HAL_StatusTypeDef send_cmd(const uint8_t* rom_code, uint8_t cmd)
{
	int i;

	if(wire_reset() != HAL_OK)
		return HAL_ERROR;

	if (!rom_code)
	{
		wire_write(DS18B20_SKIP_ROM);
	}else
	{
		wire_write(DS18B20_MATCH_ROM);
		for (i = 0; i < DS18B20_ROM_CODE_SIZE; i++)
			wire_write(rom_code[i]);
	}
	wire_write(cmd);
	return HAL_OK;
}

HAL_StatusTypeDef ds18b20_start_measure(const uint8_t* rom_code)
{
	return send_cmd(rom_code, DS18B20_CONVERT_T);
}

static HAL_StatusTypeDef ds18b20_read_scratchpad(const uint8_t* rom_code, uint8_t* scratchpad)
{
	int i;
	uint8_t crc;

	if (send_cmd(rom_code, DS18B20_READ_SCRATCHPAD) != HAL_OK)
		return HAL_ERROR;

	for (i = 0; i < DS18B20_SCRATCHPAD_SIZE; i++)
		scratchpad[i] = wire_read();

	crc = wire_crc(scratchpad, DS18B20_SCRATCHPAD_SIZE - 1);
	if (scratchpad[DS18B20_SCRATCHPAD_SIZE - 1] == crc)
		return HAL_OK;
	else
		return HAL_ERROR;
}

float ds18b20_get_temp(const uint8_t* rom_code)
{
	uint8_t scratchpad[DS18B20_SCRATCHPAD_SIZE];
	uint16_t temp;

	if(ds18b20_read_scratchpad(rom_code, scratchpad) != HAL_OK)
		return 85.0f; // 85 stopni oznacza błąd

	memcpy(&temp, &scratchpad[0], sizeof(temp));

	return temp / 16.0f;
}
